Repository: StanfordSpezi/SpeziAccessGuard
Catalog: Sources/SpeziAccessGuard/Resources/Localizable.xcstrings
Source language: en
Languages: de

# ACCESS_CODE_NOT_SET
source: Please set an access code
de: Bitte legen Sie einen Zugangscode fest.

# ACCESS_CODE_PASSCODE_ERROR %@
source: %@ wrong tries
de: %@ falsche Versuche

# ACCESS_CODE_PASSCODE_PROMPT
source: Please enter your passcode
de: Bitte geben Sie Ihren Code ein

# ACCESS_GUARD_BIOMETRICS_REASON
source: Used for biometric-based authentication.
de: Für die biometriebasierte Authentifizierung verwendet.

# ACCESS_GUARD_ERROR_BIOMETRICS_NOT_AVAILABLE
source: Biometric authentication is not available
de: Biometrische Authentifizierung ist nicht verfügbar

# ACCESS_GUARD_ERROR_INVALID_CODE_FORMAT_ONLY_NUMERIC_ALLOWED
source: Only numbers allowed
de: Nur Zahlen erlaubt

# ACCESS_GUARD_ERROR_INVALID_CODE_LENGTH
source: Invalid code length
de: Ungültige Code-Länge

# ACCESS_GUARD_ERROR_STORE_CODE_ERROR_REASON
source: Could not store the passcode.
de: Der Code konnte nicht gespeichert werden.

# ACCESS_GUARD_ERROR_TITLE
source: Passcode Error
de: Code-Fehler

# ACCESS_GUARD_ERROR_WRONG_PASSCODE_REASON
source: Wrong Passcode
de: Falscher Code

# CODE_OPTIONS_CUSTOM_ALPHANUMERIC_DIGIT
source: Custom Alphanumeric
de: Benutzerdefiniert Alphanumerisch

# CODE_OPTIONS_CUSTOM_NUMERIC_DIGIT
source: Custom Numeric
de: Benutzerdefinierte Nummer

# CODE_OPTIONS_FOUR_DIGIT
source: Four Digits
de: Vier Ziffern

# CODE_OPTIONS_SIX_DIGIT
source: Six Digits
de: Sechs Ziffern

# CODE_OPTIONS_UNKNOWN
source: Unknown Option
de: Unbekannte Option

source: Passcode Field
de: Passwort Textfeld

# PASSCODE_NOT_ACCORDING_TO_FORMAT
source: The code is not conforming to the format
de: Der Code ist nicht korrekt formatiert

# PASSCODE_SET_SUCCESS
source: Passcode set was successful
de: Neuen Code erfolgreich gespeichert

# SET_PASSCODE_BACK_BUTTON
source: Reset
de: Zurücksetzen

# SET_PASSCODE_CONFIRM_BUTTON
source: Save
de: Speichern

# SET_PASSCODE_NEXT_BUTTON
source: Next
de: Weiter

# SET_PASSCODE_PROMPT
source: Please enter your new passcode
de: Bitte geben Sie Ihren neuen Code ein

# SET_PASSCODE_REPEAT_NOT_EQUAL
source: Passcodes not equal
de: Codes stimmen nicht überein

# SET_PASSCODE_REPEAT_PROMPT
source: Please repeat your new passcode
de: Bitte wiederholen Sie Ihren neuen Code
